fabrika/src/Documents/КорректировкаОплатГТД/КорректировкаОплатГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаОплатГТД</name>
  <registerRecords>AccumulationRegister.ТаможняОплатаГТД</registerRecords>
  <attributes>
    <name>ГТД</name>
    <type>
      <types>DocumentRef.ПриходМашины</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодИнвойсНомер</name>
    <comment>ПодИнвойс номер</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

fabrika/src/Documents/ТаможняРассчёты/ТаможняРассчёты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТаможняРассчёты</name>
  <registerRecords>AccumulationRegister.ТаможняОплатаГТД</registerRecords>
  <registerRecords>AccumulationRegister.ТаможняВзаимозадолженности</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВБухгалтерии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорыКонтрагентов</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОплаты</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРаспределенияПлатежа</name>
    <comment>Вариант распределения платежа</comment>
    <type>
      <types>EnumRef.ВариантРаспределенияПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСрезаИнвойсов</name>
    <comment>Верхний предел подбора инвойсов</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПодборГТД</name>
    <attributes>
      <name>ГТД</name>
      <type>
        <types>DocumentRef.ПриходМашины</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИнвойса</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсUSD</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсВалютыОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВалютаОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доступно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодИнвойсНомер</name>
      <comment>ПодИнвойс номер</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Боркин</name>
    <comment>Приход ДС на Боркина</comment>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетОрганизации</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПрихода</name>
      <comment>Плановая дата прихода</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получено</name>
      <comment>Получено</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IDстроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <comment>Валюта</comment>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fabrika/src/Documents/КорректировкаОплатГТД/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ГТДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Владелец", "КорректировкаОплатГТД");
	ПараметрыВыбора.Вставить("Документ", Объект.Ссылка);
	ПараметрыВыбора.Вставить("ДатаСреза", КонецДня(Объект.Дата));
	ПараметрыВыбора.Вставить("ДатаДокумента" , Объект.Дата);
			
	ОткрытьФорму("Документ.ТаможняРассчёты.Форма.ФормаВыбораГТД", ПараметрыВыбора, ЭтаФорма, , , , ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Организация = Объект.ГТД.Организация;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Объект.ГТД = ВыбранноеЗначение.ГТД;
	Объект.ПодИнвойсНомер = ВыбранноеЗначение.ПодинвойсНомер;
	Объект.Остаток = ВыбранноеЗначение.Доступно;
	Организация = ВыбранноеЗначение.ГТД.Организация;	
	
КонецПроцедуры
//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
